from elf.skill import Skill

# 黄泉之烬 = Skill("331c54,9|2|633b81,13|6|7d4b8f,13|12|542c70,13|19|a85eb9,2|20|d572cf,0|15|a153be", hotkey='6')
# 摄魂追命 = Skill("49366d,9|2|4a3870,10|7|856ca4,11|17|483678,4|20|a865cf,-3|19|eca9e8,-8|11|ebc4f3", hotkey='6')
# 环灵诀 = Skill("130701,8|2|aa4dc3,13|7|8340c6,11|12|9951bc,7|21|d0c1e3,-6|21|cb6ddd,-5|13|8d678c", hotkey='7')


普攻 = Skill(hotkey='9')

灵犀三现1 = Skill("643581,7|-1|a68aae,8|5|62327a,8|9|6b2c93,1|13|d2bef0,-2|7|d6a6ef,-1|4|d4a7ed", hotkey='9')

灵犀三现2 = Skill("150c1d,7|1|9c8ba1,10|8|5a3463,9|11|bf97ef,-1|6|78447b,2|8|b597de,2|5|5e2c6a", hotkey='9')

灵犀三现3 = Skill("6b5196,10|3|472f55,10|12|0a0b35,7|14|34365d,2|14|f0e5f1,-2|9|ae85c3,-2|7|e1d0ec", hotkey='9')

破梦 = Skill("382860,10|3|543c85,12|10|523a94,14|16|cbb4ec,10|20|d675de,-1|22|e095e7,-3|7|402d62", hotkey='0')

如梦令 = Skill("54329f,9|-2|4e2e9f,13|6|f9e1fd,13|15|8468d1,1|20|5c53a1,-4|14|b487e6", hotkey='6')

同心一命 = Skill("31246e,10|0|8b5aae,16|10|ad75ce,11|22|9274af,-1|24|452f79,-4|17|9f81cd,-5|10|dddef7", hotkey='7')

聚蛊 = Skill("4c6089,10|-2|685ab0,11|9|43426d,10|17|a57cd5,4|18|212839,-2|15|6e559a,-4|10|696890", hotkey='8')
