from elf.skill import Skill

狮吼 = Skill("987c50,10|4|7b4931,14|12|ad6845,15|18|814a30,6|20|ecea88,2|17|eceb8d,-2|12|ebe583", hotkey='5')

升龙拳 = Skill("A79431,-2|13|9D332D,9|4|E0DA6F,13|19|B15630,11|25|F7FAF4,4|24|904725,-6|18|FFF3EA", hotkey='6')

无影拳 = Skill("683824,7|0|DEB560,14|7|DFC55F,14|16|AB7B40,11|22|502D18,1|22|9E6939,-5|12|D68C40", hotkey='7')

裂地斩 = Skill("867C50,10| 0|E3C670,13| 4|D0A064,14| 9|DCB26B,16| 16|BFAD61,4|18|543E23,-4| 11|ECE687", hotkey='8')

旋风腿 = Skill("BD8252,4|0|C99661,10|5|764329,14|11|5E412F,14|20|E5C871,7|22|E9E082,-5|20|EFE9B4", hotkey='0')

开山拳 = Skill("ddce72,9|2|d0b680,12|12|6b582e,11|21|9c8252,6|22|ad9e63,-3|20|cdbb65,-5|11|735b3e", hotkey='9')

炼火拳 = Skill("e1ce74,8|1|ddae63,14|13|693f31,12|18|b68855,9|20|dfc379,5|21|ddc56a,-2|17|c77f43", hotkey='0')

横扫 = Skill("7f4f31,7|1|b6824b,14|8|be7e35,15|15|766c44,12|22|746e2b,7|22|b57929,-2|20|b2b35d", hotkey='e')

劈云拳 = Skill(hotkey='6')
